; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v2 - type_3 ?v8 - type_1)
 	      (pred_3 ?v7 - object ?v8 - type_1)
	      (pred_4 ?v2 - type_3 ?v5 - type_2)
	      (pred_1 ?v2 - type_3 ?v7 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v2 - type_3 ?v4 ?v6 - type_1)
       :precondition (and  (pred_2 ?v2 ?v4))
       :effect (and  (pred_2 ?v2 ?v6)
		     (not (pred_2 ?v2 ?v4))))

   (:action op_3
       :parameters (?v2 - type_3 ?v1 - object ?v3 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v3) (pred_2 ?v2 ?v3) (pred_4 ?v2 ?v5))
       :effect (and (pred_1 ?v2 ?v1 ?v5)
		    (not (pred_3 ?v1 ?v3)) 
		    (not (pred_4 ?v2 ?v5))))

   (:action op_2
       :parameters (?v2 - type_3 ?v1 - object ?v3 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v1 ?v5) (pred_2 ?v2 ?v3))
       :effect (and (pred_3 ?v1 ?v3)
		    (pred_4 ?v2 ?v5)
		    (not (pred_1 ?v2 ?v1 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_04 obj_01 - type_3
obj_09 obj_07 obj_06 obj_02 - type_2
obj_05 obj_08 obj_12 - type_1
obj_11 obj_10 obj_03 - object)
(:init
(pred_2 obj_04 obj_08)
(pred_4 obj_04 obj_09)
(pred_4 obj_04 obj_07)
(pred_2 obj_01 obj_05)
(pred_4 obj_01 obj_06)
(pred_4 obj_01 obj_02)
(pred_3 obj_11 obj_12)
(pred_3 obj_10 obj_05)
(pred_3 obj_03 obj_12)
)
(:goal
(and
(pred_3 obj_11 obj_05)
(pred_3 obj_10 obj_05)
(pred_3 obj_03 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_04 obj_12) (pred_2 obj_01 obj_12))))
  )
)
)

; plan
1. (op_1 obj_04 obj_08 obj_12)
   deleted: (pred_2 obj_04 obj_08)
   added: (pred_2 obj_04 obj_12)
   goals met: 2 of 3
2. (op_3 obj_04 obj_11 obj_12 obj_07)
   deleted: (pred_3 obj_11 obj_12) (pred_4 obj_04 obj_07)
   added: (pred_1 obj_04 obj_11 obj_07)
   goals met: 2 of 3
3. (op_1 obj_04 obj_12 obj_05)
   deleted: (pred_2 obj_04 obj_12)
   added: (pred_2 obj_04 obj_05)
   goals met: 2 of 3
4. (op_2 obj_04 obj_11 obj_05 obj_07)
   deleted: (pred_1 obj_04 obj_11 obj_07)
   added: (pred_3 obj_11 obj_05) (pred_4 obj_04 obj_07)
   goals met: 3 of 3
